#================================================================
# 数学计算方法
#----------------------------------------------------------------
# 一维非线性方程：二分法、牛顿法、割线法、插值法、逆插值法、逆二测插值法、线性分式插值法
# 非线性方程组的解法： 牛顿法、割线法、阻尼牛顿法、Broyden法
# 内插问题： 分段常数内插法、线性内插法、多项式内插法、样条内插法、基于高斯过程的内插法
# 外插问题： 线性外插法、多项式外插法、锥外插法、法国曲线外插法 
# 数值积分问题： 辛普森法则、梯形法则、精炼梯形法则、高斯积分法则、牛顿-柯特斯积分法则、高斯-勒让德积分法则
# 数值微分问题： 有限差分近似法、微分求积法、有限差分系数、插值微分法
# 常微分方程： 欧拉方程、泰勒级数法、龙格-库塔法、四阶龙格-库塔法、预估-校正法
# 偏微分方程： 有限元法、有限差分法、有限体积法
# 随机数生成器： 真 and 伪， 伪：一大堆
#----------------------------------------------------------------